sphereOsc/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2500;
        startFace       367500;
    }
    outlet
    {
        type            patch;
        nFaces          2500;
        startFace       370000;
    }
    sideXMin
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2500;
        startFace       372500;
    }
    sideXMax
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2500;
        startFace       375000;
    }
    sideYMin
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2500;
        startFace       377500;
    }
    sideYMax
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2500;
        startFace       380000;
    }
)

// ************************************************************************* //
